Chapter02/SalesQuoteDemo/SalesQuoteProcess/SOA/testsuites/ArbitraryCycle.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
    	<soap:Body>
        		<ns1:start xmlns:ns1="http://xmlns.oracle.com/bpmn/bpmnProcess/ArbitaryCycle" xmlns:ns2="http://www.mycompany.com/ns/salesquote">
            			<ns2:QuoteRequest>
                				<ns2:Summary>
                    					<ns2:OpportunityID>ID00009</ns2:OpportunityID>
                    					<ns2:AccountName>ABC00009</ns2:AccountName>
                    					<ns2:NewCustomer>NEW</ns2:NewCustomer>
                    					<ns2:PurchaseToDate>2018</ns2:PurchaseToDate>
                    					<ns2:Address>
                        						<ns2:Street>Some</ns2:Street>
                        						<ns2:City>City</ns2:City>
                        						<ns2:State>State</ns2:State>
                        						<ns2:Zip>33333</ns2:Zip>
                        						<ns2:Country>UK</ns2:Country>
                    </ns2:Address>
                    					<ns2:CustomerType>NEW</ns2:CustomerType>
                    					<ns2:Industry>IT</ns2:Industry>
                    					<ns2:SalesRepId>salesrep</ns2:SalesRepId>
                    					<ns2:SalesRepName></ns2:SalesRepName>
                    					<ns2:SalesRepContact></ns2:SalesRepContact>
                    					<ns2:EffectiveDiscount>50</ns2:EffectiveDiscount>
                </ns2:Summary>
                				<ns2:QuoteRequestStatus>NEW</ns2:QuoteRequestStatus>
                				<ns2:RecommendedDiscount>
                    					<ns2:RevenueRange>1</ns2:RevenueRange>
                    					<ns2:SuggestedDiscount>1</ns2:SuggestedDiscount>
                    					<ns2:FutureDiscountProvision>1</ns2:FutureDiscountProvision>
                </ns2:RecommendedDiscount>
            </ns2:QuoteRequest>
        </ns1:start>
    </soap:Body>
</soap:Envelope>
